{"3NyNPJaemMYsL14DK2tO01": {"name": "Cheryl", "fact": "Did you know that Cheryl was born and raised in Newcastle? She grow up on council estates in the suburbs of Walker and Heaton. She came to fame within Girls Aloud before moving onto a solo career."}, "12EtLdLfJ41vUOoVzPZIUy": {"name": "Girls Aloud", "fact": "When they were active, one of their five members was Cheryl. Did you know that she's a Geordie? Post Girls Aloud she's gone onto have a successful solo career."}, "5epNPX8lcU2simDUaCfgeB": {"name": "Owen Brannigan", "fact": "Did you know that Owen is a Geordie? He was born in Annitsford, a little village in North Tyneside."}, "2s96tw2STQo5HTXiiGdcpC": {"name": "David Clelland", "fact": "Did you know that David is a Geordie? He was born in Gateshead. Singing wasn't his main job, that was being an MP for the Tyne Bridge parliamentary constituency from 1985 until it was abolished in 2010."}, "5RNFFojXkPRmlJZIwXeKQC": {"name": "Bryan Ferry", "fact": "Did you know that Bryan is from the North East? He was born and raised in Washington, and studied fine art at Newcastle University in the 60s."}, "3fhOTtm0LBJ3Ojn4hIljLo": {"name": "Roxy Music", "fact": "Did you know that Bryan Ferry formed this group in 1970? He's from the North East, having been born and raised in Washington."}, "1n65zfwYIj5kKEtNgxUlWb": {"name": "Siouxsie and the Banshees", "fact": "Did you know that a former member of this group was Bryan Ferry? He's from the North East, having been born and raised in Washington. He studied fine art at Newcastle University in the 60s, which is when he was in the band."}, "6BmmCdfxkGvxx1RkDNXpIX": {"name": "Graeme Danby", "fact": "Did you know that Graeme is from the North East? He was born in Consett, a town about 14 miles south-west of Newcastle."}, "6xq4VamyyoknqqAg44ZzlK": {"name": "Alex Glasgow", "fact": "Did you know that Alex is a Geordie? He was from Gateshead. He became widely known for his own style of Geordie songs, often on polictical topics, generally socialist and/or trades union-focused."}, "345IUEgYmPBU0JAHuRRGyA": {"name": "Robson & Jerome", "fact": "Did you know that Robson, from this duo, is a Geordie? He was raised in Dudley, a villlage in North Tyneside. As a bonus fact: the other half of this duo, Jerome, protrayed Bronn in Game of Thrones!"}, "4Ii2nZkY4Metxf4YDwBlaF": {"name": "Jed Grimes", "fact": "Did you know that Jed is a North Easte musician? He played in a folk-rock band called Hedgehog Pie in the 1970s."}, "27jDmuF9yB0lXhwaNyMaCs": {"name": "Johnny Handle", "fact": "Did you know that Johnny is a Geordie? He was born and raised in Wallsend."}, "2BIw82ChQI4XFqjygoNXhQ": {"name": "The High Level Ranters", "fact": "Did you know that Newcastle is this bands hometown? Jim was born in Gateshead, Johnny in Wallsend and Colin in North Shields; this makes them all Geordies!"}, "0TJOVQKoS7sbGVn8RkkvPI": {"name": "Brian Johnson", "fact": "Did you know that Brian is a Geordie? He was born and raised in Dunston, a village on the south bank of the River Tyne."}, "0IzJYdxaNLwrC7diSCu0iY": {"name": "Geordie", "fact": "The name says it all really - this band was definitely from Newcastle. Did you know though that their most famous member is Brian Johnson, who went onto become the lead singer in AC/DC?"}, "711MCceyCBcFnzjGY4Q7Un": {"name": "AC/DC", "fact": "Following the death of Bon Scott, Brian Johnson became the lead singer of AC/DC. What you may not know is that he's a Geordie, having been born and raised in Dunston, a village on south bank of the River Tyne."}, "5qEEbES7lWt59woamgURp5": {"name": "Lou Killen", "fact": "Did you know that Lou is a Geordie? They're from Gateshead and formed one of Britian's first folk clubs in 1958 in Newcastle."}, "4qWTqOdDnH56Qak9UjmpKz": {"name": "The Clancy Brothers", "fact": "Did you know that, despite being an Irish band, one of their past members, Lou, was a Geordie? They're from Gateshead and formed one of Britian's first folk clubs in 1958 in Newcastle."}, "0FI0kxP0BWurTz8cB8BBug": {"name": "Mark Knopfler", "fact": "Despite being born in Glasgow, Mark was raised in Newcastle. At the start of his career, he co-founded the rock band Dire Straits. Since then he's gone on to have a solo career."}, "22wbIvCMDEThS8KIjE1b4K": {"name": "David Knopfler", "fact": "Despite being born in Glasgow, David was raised in Newcastle. He's the younger brother of Mark Knopfler, with whom he founded rock band Dire Straits."}, "0WwSkZ7LtFUFjGjMZBMt6T": {"name": "Dire Straits", "fact": "Two of the founding members of the Dire Straits were Mark & David Knopfler. Whilst they were both born in Glasgow, they were raised in Newcastle."}, "4AgFg0hHythyklEs4t7XKt": {"name": "Lindisfarne", "fact": "Did you know that this bands name came from the small island of the same name that's off the coast of Northumberland?"}, "5JmiJ0uN4rutaRsDfBUPHl": {"name": "Jimmy Nail", "fact": "Did you know that Jimmy is a Geordie? He was born in Newcastle in 1954 as James Michael Aloysius Bradford."}, "3WKTiixhkaWRexRUs3GKBw": {"name": "Alan Price", "fact": "Did you know that Alan is a Geordie? He was born and raised in Washington and educated at Jarrow Grammar School. He was a founding member of the the Tyneside group \"The Alan Price Rhythm and Blues Combo\", which later transitioned in The Animals."}, "3ICflSq6ZgYAIrm2CTkfVP": {"name": "The Animals", "fact": "Did you know that The Animals is a Newcastle based band? It was formed when five Geordies came together and \"The Alan Price Rhythm and Blues Combo\" transitioned into The Animals."}, "3miNucraVWk4hdVsIxn7id": {"name": "Eric Burdon", "fact": "Did you know that Eric is a Geordie? He was born in the Walker area of Newcastle. In his earlier career he was a vocalist of rock band The Animals, and subsequently the funk band War. Since then he's had a solo career."}, "3ICyfoySNDZqtBVmaBT84I": {"name": "War", "fact": "Did you know that War was originally called Eric Burdon and War, and that Eric was a Geordie? Eric was born in the Walker area of Newcastle, and also performed with The Animals."}, "0Ty63ceoRnnJKVEYP0VQpk": {"name": "Sting", "fact": "Did you know that Sting is a Geordie? He was born and raised in the Wallsend area of Newcastle. He's had a successful career with The Police, and even performed at The Queen's Birthday Party in 2018."}, "5NGO30tJxFlKixkPSgXcFE": {"name": "The Police", "fact": "Did you know that their lead vocalist, Sting, is a Geordie? He was born and raised in the Wallsend area of Newcastle."}, "1luY92PbdGWRyBRY1ZR7o1": {"name": "The Unthanks", "fact": "Did you know that the Unthank sisters are Geordies? They were raised in the village of Ryton, on the south bank of the River Tyne."}, "6bz0ztmnpeofmoFksV3DqL": {"name": "The Wildhearts", "fact": "Did you know that The Wildhearts are a Newcastle based band? Their leader, Ginger, was born and raised in South Shields."}, "0d49iRrp4iVZggKbcpxnqI": {"name": "The Quireboys", "fact": "Did you know that The Quireboys has strong ties to Newcastle? Their frontman, Spike, is a Geordie, having been born in Newcastle."}, "1DtvquLh9kUOQHnOwuiHdv": {"name": "Alan Hull", "fact": "Did you know that Alan was a Geordie? He was born and raised in the Benwell suburb of Newcastle. He was a founding member of the Tyneside folk rock band Lindisfarne."}, "2ycnb8Er79LoH2AsR5ldjh": {"name": "Pet Shop Boys", "fact": "Did you know that Neil is a Geordie? He was born and raised in North Shields!"}, "2PPMU9qWa1nt4O6g4wtZj8": {"name": "Andy Taylor", "fact": "Did you know that Andy is a Geordie? He was born and raised in Cullercoats!"}, "0lZoBs4Pzo7R89JM9lxwoT": {"name": "Duran Duran", "fact": "Did you know that former member Andy Taylor is a Geordie? "}, "5z96yaS2s1USscDldCCDgw": {"name": "Angelic Upstarts", "fact": "Did you know that Angelic Upstarts are from South Shields? That means they're a Geordie band!"}, "2gmeFH5Iz8UEA7K0OHDePQ": {"name": "Ant & Dec", "fact": "Did you know that Ant & Dec are both Geordies? They're also better known as a presenting duo on TV."}, "03hfAxVdAWj7kxDnSG0fLD": {"name": "The Shadows", "fact": "Did you know that Bruce, The Shadow's rhythm guitarist, is a Geordie? Despite being born in the south, he grew up in Chester-le-Street."}, "4IdvJZeciaa37wYr2qBpjm": {"name": "Cliff Richard and The Shadows", "fact": "Did you know that Bruce, The Shadow's rhythm guitarist, is a Geordie? Despite being born in the south, he grew up in Chester-le-Street."}, "6FKokxvL5PCWIxrVhMyDgI": {"name": "Demob Happy", "fact": "Did you know that Demob Happy was originally a Geordie band? "}, "3SRTWBeGhX3o5DCQ2zzTdI": {"name": "Dubstar", "fact": "Did you know that Dubstar is a band with Geordie origins? They formed in the Jesmond suburb of Newcastle."}, "3Bet1o6dTKJG8o4HcrbI37": {"name": "Hank Marvin", "fact": "Did you know that Hank is a Geordie? He is best known for being the lead guitarist of The Shadows."}, "3e7awlrlDSwF3iM0WBjGMp": {"name": "Little Mix", "fact": "Did you know that Jade is a Geordie? She was raised in the Laygate neighbourhood of South Shields."}, "38SqjWcm8au0qiQZvd3FbF": {"name": "Joe McElderry", "fact": "Did you know that Joe is a Geordie? He was born in South Shields and raised in Tyneside."}, "7sx3r4lMo079vO7lIi0fng": {"name": "Lanterns on the Lake", "fact": "Did you know that Lanterns on the Lake is a Geordie band?"}, "6edGSAX5dVpeJVwu1Q0NwJ": {"name": "The Lighthouse Family", "fact": "Did you know that this duo came together in Newcastle? Tunde and Paul meet when studying at the university and also working at the same bar."}, "3mIj9lX2MWuHmhNCA7LSCW": {"name": "The 1975", "fact": "Did you know that lead vocalists / rhythm guitarist, Matthew, is a Geordie? Although not born in the North East, he was raised in Prudhoe, a town about 11 miles west of Newcastle."}, "048FBwXjFYBWxSggPDipic": {"name": "Maxïmo Park", "fact": "Did you know that this band has its origins in Newcastle?"}, "75OpU10VolujEA1pl0h1dX": {"name": "Nadine Shah", "fact": "Did you know that Nadine is a Geordie? She was born in Whitburn, a village in South Tyneside."}, "0VeQgI9lzgoOMszAOq0iml": {"name": "Richard Dawson", "fact": "Did you know that Richard is a Geordie? He was born and raised in Newcastle."}, "6zlR5ttMfMNmwf2lecU9Cc": {"name": "Sam Fender", "fact": "Did you know that Sam is a Geordie? He was born and raised in North Shields."}, "1MZ8NERIuOS610KBhr6yna": {"name": "Tygers of Pan Tang", "fact": "Did you know that this is a Geordie band? They are based in Whitley Bay."}, "5fwaejlOHVBAw1KhIPPaQe": {"name": "Venom", "fact": "Did you know that this is a Geordie band? The band formed in Newcastle in 1978."}}