{
  "0": "Us seahorses are elusive creatures, almost like a mythological animal made flesh. We appear in Roman and Greek mythology, pulling either Neptune or Poseidon's chariot.",
  "1": "You can find a ring of twelve of my family and friends surrounding the Civic Centre's tower.",
  "2": "Some humans believed that us seahorses protected the souls of dead sailors on the way to the underworld. It's hardly surprising that sailors viewed us as good luck charms.",
  "3": "Because we're so calm and mild-mannered, many humans think we represent patience and contentment.",
  "4": "We're sometimes used in traditional Chinese medicine to treat ailments as varied as asthma, sexual dysfunction and kidney problems.",
  "5": "If you were born between February 19th and March 27th, congratulations - like me you're a Seahorse. We're your Celtic Zodiac animal sign.",
  "6": "I'm never going to get pregnant! We're the only species on earth where the male gives birth.",
  "7": "A couple of my friends can be found on the city's coat of arms. They remind people of Newcastle's history as a sea port.",
  "8": "You can find one of my friends, Stephen the Seahorse, at all major rugby events in Newcastle upon Tyne. Hopefully he won't confuse my best friend, <!@689751502700675072>, with his other friend of the same name from Leinster in Ireland, who is also in the Rugby world!",
  "9": "I move by propelling myself with a small fin on my back that flutters up to 35 times per second. To steer I use even smaller pectoral fins located near the back of my head.",
  "10": "There's 40 known species of my friends and family.",
  "11": "I prefer to swim in a pair with my tail linked together. Unfortunately <!@689751502700675072> can't swim :cry:",
  "12": "I swim upright and avoid predators by mimicking the colour of underwater plants.",
  "13": "Thankfully most marine predators avoid me, as I'm too bony and indigestible. I still have to avoid crabs though! :crab: :fearful:",
  "14": "Because of my body shape, I need to be very careful to avoid getting caught in storm-roiled seas. I'm not the best swimmer and could easily die, and nobody wants that.",
  "15": "I can move each of my eyes independently. This means I can follow the activity of passing sea life without giving my presence away.",
  "16": "I don't have teeth or a stomach. This means I have to eat almost constantly to stay alive because food I like plankton and tiny fish passes through my digestive system so quickly.",
  "17": "I can consume over 3,000 brine shrimp per day.",
  "18": "I'm monogamous and mate for life.",
  "19": "We engage in an eight hour courtship dance. This includes spinning around, swimming side by side, and changing colours; think of a SSAGO Ceilidh on steroids!",
  "20": "When my fellow seahorses give birth, as many as 1,500 young can be born. Can you imagine remembering all those names!",
  "21": "For the scientists here, you may know me better as being from the Hippocampus genus. Sounds like a university for hippopotamus' :hippopotamus: :rofl:",
  "22": "I like living in sheltered areas with lots of seaweeds and grasses. I also like coral reefs and mangroves.",
  "23": "The lifespan of my fellow seahorses is estimated to be between 1 to 5 years depending on species. Thankfully I'm immortal so I've not got to worry about that!"
}